#pragma once
#include <stdint.h>

// ======================================
// ПАРАМЕТРЫ ВЕЛОСИПЕДА
// ======================================


// --------------------------------------
// Колесо
// --------------------------------------

// Диаметр колеса с покрышкой 22"
constexpr float WHEEL_CIRCUMFERENCE = 1.755f;


// --------------------------------------
// Батарея
// --------------------------------------

// 13S Li-Ion

// Полностью заряженная батарея
constexpr float BATTERY_FULL_VOLTAGE = 54.6f;

// Полностью разряженная батарея
constexpr float BATTERY_EMPTY_VOLTAGE = 39.0f;

// Ёмкость батареи
constexpr float BATTERY_CAPACITY_AH = 20.0f;

// Расчётная энергия батареи
constexpr float BATTERY_CAPACITY_WH = 960.0f;


// --------------------------------------
// FT85BD
// --------------------------------------

constexpr int FT85BD_BAUDRATE = 115200;


// --------------------------------------
// UI
// --------------------------------------

// обновление экрана каждые 100 мс

constexpr uint32_t UI_UPDATE_MS = 100;